# Insert Method (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
CurveArray..::..Insert Method
CurveArray Class See Also
---
Insert the specified curve into the array.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public virtual void Insert(
	Curve item,
	int index
)
```

Visual Basic
---
```text
Public Overridable Sub Insert ( _
	item As Curve, _
	index As Integer _
)
```

Visual C++
---
```text
public:
virtual void Insert(
	Curve^ item,
	int index
)
```

# ### Parameters
item
    Type: Autodesk.Revit.DB..::..CurveThe curve to be inserted into the array.
index
    Type: System..::..Int32The curve will be inserted before this index.
# ### Return Value
Returns whether the curve was inserted into the array.
# See Also
CurveArray Class
Autodesk.Revit.DB Namespace